testing/fixtures/QL/MCP/Logger/Service/Serializer/XMLGenerator/complex.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:pcfg="http://schemas.microsoft.com/wbem/wsman/1/config/PluginConfiguration">
    <s:Header>
        <wsa:ReplyTo>
            <wsa:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
        </wsa:ReplyTo>
        <wsman:Locale s:mustUnderstand="false" xml:lang="en-US"/>
        <wsa:MessageID>0C875FFC-61AB-4A75-A4AF-5F89ADCE0D63</wsa:MessageID>
        <wsa:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Create</wsa:Action>
        <wsman:ResourceURI s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</wsman:ResourceURI>
        <wsa:To>http://windows-host:5985/wsman</wsa:To>
        <wsman:MaxEnvelopeSize s:mustUnderstand="true">102400</wsman:MaxEnvelopeSize>
    </s:Header>
    <s:Body>
        <rsp:Shell>
            <rsp:InputStreams>stdin</rsp:InputStreams>
            <rsp:OutputStreams>stdout stderr</rsp:OutputStreams>
            <rsp:IdleTimeOut s:mustUnderstand="true">PT60S</rsp:IdleTimeOut>
            <rsp:Lifetime s:mustUnderstand="true">PT3600S</rsp:Lifetime>
            <rsp:BufferMode s:mustUnderstand="true">Block</rsp:BufferMode>
            <rsp:Environment>
                <rsp:Variable Name="TEST_VAR">variable 1</rsp:Variable>
                <rsp:Variable Name="TEST_VAR2">variable 2</rsp:Variable>
            </rsp:Environment>
        </rsp:Shell>
        <rsp:CommandLine>
            <rsp:Command>dir</rsp:Command>
            <rsp:Arguments>sample arguments 1 --flag</rsp:Arguments>
        </rsp:CommandLine>
        <rsp:Signal CommandId="9A39ED24-1752-4459-9AC2-6B0E8F0DCEC7">
            <rsp:Code>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/signal/ctrl_c</rsp:Code>
        </rsp:Signal>
    </s:Body>
</s:Envelope>
